Terraform plan in __terraform__
<details>
  <summary>Plan: 5 to add, 1 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_onNewMessage_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "gmail_onNewMessage_function" {
      - environment_variables = {} -> null
      + https_trigger_url     = (known after apply)
      ~ id                    = "******************************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "gmail-onNewMessage-receiver"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#7f7102a0a4a2125c5f3c6b9a948af83e"
        # (7 unchanged attributes hidden)

      ~ event_trigger {
            # (2 unchanged attributes hidden)

          ~ failure_policy {
              ~ retry = false -> (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.oauth2_init_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "oauth2_init_function" {
      - environment_variables = {} -> null
      ~ https_trigger_url     = "https://europe-west1-lilaobot.cloudfunctions.net/oauth2-init" -> (known after apply)
      ~ id                    = "**************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "oauth2-init"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier_function_content.zip" -> "gmail_notifier_function_content.zip#7f7102a0a4a2125c5f3c6b9a948af83e"
        # (8 unchanged attributes hidden)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher_function_content.zip" -> "slack_publisher_function_content.zip#dcfe09f0e51d03cbde6b1b90b17f1e51"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function_iam_member.gmail_onNewMessage_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "gmail_onNewMessage_invoker" {
      + cloud_function = "gmail-onNewMessage-receiver"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_cloudfunctions_function_iam_member.oauth2_init_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "oauth2_init_invoker" {
      + cloud_function = "oauth2-init"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_storage_bucket_object.gmail_notifier_archive must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "s5QKSw==" -> (known after apply)
      ~ detect_md5hash = "2odkjPdQh4UIQttqGBkViQ==" -> "different hash" # forces replacement
      ~ id             = "***********************************************************************************************" -> (known after apply)
      ~ md5hash        = "2odkjPdQh4UIQttqGBkViQ==" -> (known after apply)
      ~ name           = "gmail_notifier_function_content.zip#da87648cf75087850842db6a18191589" -> "gmail_notifier_function_content.zip#7f7102a0a4a2125c5f3c6b9a948af83e" # forces replacement
      ~ output_name    = "gmail_notifier_function_content.zip#da87648cf75087850842db6a18191589" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier_function_content.zip%23da87648cf75087850842db6a18191589" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 3 to destroy.
```
</details>

Plan generated in [Create terraform plan #19](https://github.com/Zenika/lilaobot/actions/runs/1012878900)